Solver_Examples/SA_RANS_FOAM/bfs_test/0/nuef3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuef4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.00013e-4;;

boundaryField
{
    inlet
     {
        type            fixedValue;
        value           uniform 2.0198e-05;
     }
    outlet
     {
         type            zeroGradient;
       // value           uniform 0.000100013;
    }
    frontAndBack
     {
       type empty;
     }
    noslipwall
     {
        type            calculated;
        value           uniform 1e-5;
     }
}



// ************************************************************************* //

// ************************************************************************* //

