Solver_Examples/SA_RANS_FOAM/bfs_test/0/phi1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1735
(
1.23982e-05
2.38085e-12
1.23982e-05
-2.56826e-11
1.23988e-05
-5.94073e-10
1.24058e-05
-6.96338e-09
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
-1.23982e-05
-1.60129e-05
-2.06814e-05
-2.67111e-05
-3.44987e-05
-4.45568e-05
-5.75474e-05
-7.43253e-05
-9.59948e-05
-0.000123982
-0.000371946
-0.000287984
-0.000222976
-0.000172642
-0.00013367
-0.000103496
-8.01334e-05
-6.20443e-05
-4.80387e-05
-3.71946e-05
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
35
(
2.79388e-06
3.39011e-06
4.11359e-06
4.99145e-06
6.05667e-06
7.3492e-06
8.91757e-06
1.08206e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
    noslipwall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
