Solver_Examples/SA_RANS_FOAM/bfs_test/0/phi4
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1735
(
1.49145e-05
2.8659e-12
1.49145e-05
-3.08962e-11
1.49152e-05
-7.14642e-10
1.49236e-05
-8.37663e-09
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
-1.49145e-05
-1.92628e-05
-2.48788e-05
-3.21322e-05
-4.15004e-05
-5.35998e-05
-6.92268e-05
-8.94099e-05
-0.000115477
-0.000149145
-0.000447434
-0.000346432
-0.00026823
-0.00020768
-0.000160799
-0.000124501
-9.63967e-05
-7.46365e-05
-5.77883e-05
-4.47434e-05
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
35
(
3.36091e-06
4.07815e-06
4.94845e-06
6.00449e-06
7.28589e-06
8.84075e-06
1.07274e-05
1.30167e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
    noslipwall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
